In [3]:
import sqlite3

In [4]:
sqlite_db = 'houses.sqlite'
conn = sqlite3.connect(sqlite_db)
# c stands for our connection to our database
c = conn.cursor()

In [5]:
c.execute('CREATE TABLE houses (pk INTEGER PRIMARY KEY, sqft INTEGER, bdrms INTEGER, age INTEGER, price INTEGER);')

OperationalError: table houses already exists

In [6]:
conn.commit()

In [7]:
# Lets create some data now that we created a table called HOUSES


last_sale = (None, 4000, 5,22,619000)
c.execute('INSERT INTO houses VALUES (?,?,?,?,?)', last_sale)
conn.commit()

In [8]:
# Now we can look at what our table looks like now
# Execute is the syntax to insert one at a time. Executemany (used below) is for routines
c.execute ('SELECT * FROM houses;')

In [9]:
conn.commit()

In [10]:
results = c.execute ('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 4000, 5, 22, 619000),
 (3, 2390, 4, 34, 319000),
 (4, 1870, 3, 14, 289000),
 (5, 1505, 3, 90, 269000),
 (6, 2104, 3, 70, 399900),
 (7, 1600, 3, 28, 329900),
 (8, 2400, 3, 44, 369000),
 (9, 1416, 2, 49, 232000),
 (10, 3000, 4, 75, 539900),
 (11, 1985, 4, 61, 299900),
 (12, 1534, 3, 12, 314900),
 (13, 1427, 3, 57, 198999),
 (14, 1380, 3, 14, 212000),
 (15, 1494, 3, 15, 242500),
 (16, 1940, 4, 7, 239999),
 (17, 2000, 3, 27, 347000),
 (18, 1890, 3, 45, 329999),
 (19, 4478, 5, 49, 699900),
 (20, 1268, 3, 58, 259900),
 (21, 2300, 4, 77, 449900),
 (22, 1320, 2, 62, 299900),
 (23, 1236, 3, 78, 199900),
 (24, 2609, 4, 5, 499998),
 (25, 3031, 4, 21, 599000),
 (26, 1767, 3, 44, 252900),
 (27, 1888, 2, 79, 255000),
 (28, 1604, 3, 13, 242900),
 (29, 1962, 4, 53, 259900),
 (30, 3890, 3, 36, 573900),
 (31, 1100, 3, 60, 249900),
 (32, 1458, 3, 29, 464500),
 (33, 2526, 3, 13, 469000),
 (34, 2200, 3, 28, 475000),
 (35, 2637, 3, 25, 299900),
 (36, 1839, 2, 40, 349900),
 (37, 1000, 1, 5, 169900),
 (38, 2040, 4, 75, 314900),
 (39, 3137, 3, 67, 579900),
 (40, 1811, 4, 24, 285900),
 (41, 1437, 3, 50, 249900),
 (42, 1239, 3, 22, 229900),
 (43, 2132, 4, 28, 345000),
 (44, 4215, 4, 66, 549000),
 (45, 2162, 4, 43, 287000),
 (46, 1664, 2, 40, 368500),
 (47, 2238, 3, 37, 329900),
 (48, 2567, 4, 57, 314000),
 (49, 1200, 3, 76, 299000),
 (50, 852, 2, 70, 179900),
 (51, 1852, 4, 64, 299900),
 (52, 1203, 3, 11, 239500),
 (53, 4000, 5, 22, 619000)]

In [11]:
# doing this for each file, we can set up a command that will make this insertion a routine

recent_sales = [
  (None, 2390, 4, 34, 319000),
  (None, 1870, 3, 14, 289000),
  (None, 1505, 3, 90, 269000),
]
# EXECUTE MANY is the syntax to insert many
c.executemany('INSERT INTO houses VALUES (?,?,?,?,?)', recent_sales)
conn.commit()

In [12]:
results = c.execute ('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 4000, 5, 22, 619000),
 (3, 2390, 4, 34, 319000),
 (4, 1870, 3, 14, 289000),
 (5, 1505, 3, 90, 269000),
 (6, 2104, 3, 70, 399900),
 (7, 1600, 3, 28, 329900),
 (8, 2400, 3, 44, 369000),
 (9, 1416, 2, 49, 232000),
 (10, 3000, 4, 75, 539900),
 (11, 1985, 4, 61, 299900),
 (12, 1534, 3, 12, 314900),
 (13, 1427, 3, 57, 198999),
 (14, 1380, 3, 14, 212000),
 (15, 1494, 3, 15, 242500),
 (16, 1940, 4, 7, 239999),
 (17, 2000, 3, 27, 347000),
 (18, 1890, 3, 45, 329999),
 (19, 4478, 5, 49, 699900),
 (20, 1268, 3, 58, 259900),
 (21, 2300, 4, 77, 449900),
 (22, 1320, 2, 62, 299900),
 (23, 1236, 3, 78, 199900),
 (24, 2609, 4, 5, 499998),
 (25, 3031, 4, 21, 599000),
 (26, 1767, 3, 44, 252900),
 (27, 1888, 2, 79, 255000),
 (28, 1604, 3, 13, 242900),
 (29, 1962, 4, 53, 259900),
 (30, 3890, 3, 36, 573900),
 (31, 1100, 3, 60, 249900),
 (32, 1458, 3, 29, 464500),
 (33, 2526, 3, 13, 469000),
 (34, 2200, 3, 28, 475000),
 (35, 2637, 3, 25, 299900),
 (36, 1839, 2, 40, 349900),
 (37, 1000, 1, 5, 169900),
 (38, 2040, 4, 75, 314900),
 (39, 3137, 3, 67, 579900),
 (40, 1811, 4, 24, 285900),
 (41, 1437, 3, 50, 249900),
 (42, 1239, 3, 22, 229900),
 (43, 2132, 4, 28, 345000),
 (44, 4215, 4, 66, 549000),
 (45, 2162, 4, 43, 287000),
 (46, 1664, 2, 40, 368500),
 (47, 2238, 3, 37, 329900),
 (48, 2567, 4, 57, 314000),
 (49, 1200, 3, 76, 299000),
 (50, 852, 2, 70, 179900),
 (51, 1852, 4, 64, 299900),
 (52, 1203, 3, 11, 239500),
 (53, 4000, 5, 22, 619000),
 (54, 2390, 4, 34, 319000),
 (55, 1870, 3, 14, 289000),
 (56, 1505, 3, 90, 269000)]

In [21]:
# Now we loaded a database of csv homesites to my harddrive  in Data in my Jays_stuff folder at my root directory

# Load this numpy function

from numpy import genfromtxt
data = (genfromtxt('housing-data.csv', dtype = 'i8',
                 delimiter = ',', skip_header = 1)).tolist()
data

[[2104, 3, 70, 399900],
 [1600, 3, 28, 329900],
 [2400, 3, 44, 369000],
 [1416, 2, 49, 232000],
 [3000, 4, 75, 539900],
 [1985, 4, 61, 299900],
 [1534, 3, 12, 314900],
 [1427, 3, 57, 198999],
 [1380, 3, 14, 212000],
 [1494, 3, 15, 242500],
 [1940, 4, 7, 239999],
 [2000, 3, 27, 347000],
 [1890, 3, 45, 329999],
 [4478, 5, 49, 699900],
 [1268, 3, 58, 259900],
 [2300, 4, 77, 449900],
 [1320, 2, 62, 299900],
 [1236, 3, 78, 199900],
 [2609, 4, 5, 499998],
 [3031, 4, 21, 599000],
 [1767, 3, 44, 252900],
 [1888, 2, 79, 255000],
 [1604, 3, 13, 242900],
 [1962, 4, 53, 259900],
 [3890, 3, 36, 573900],
 [1100, 3, 60, 249900],
 [1458, 3, 29, 464500],
 [2526, 3, 13, 469000],
 [2200, 3, 28, 475000],
 [2637, 3, 25, 299900],
 [1839, 2, 40, 349900],
 [1000, 1, 5, 169900],
 [2040, 4, 75, 314900],
 [3137, 3, 67, 579900],
 [1811, 4, 24, 285900],
 [1437, 3, 50, 249900],
 [1239, 3, 22, 229900],
 [2132, 4, 28, 345000],
 [4215, 4, 66, 549000],
 [2162, 4, 43, 287000],
 [1664, 2, 40, 368500],
 [2238, 3, 37, 329900],
 [2567, 4, 57, 314000],
 [1200, 3, 76, 299000],
 [852, 2, 70, 179900],
 [1852, 4, 64, 299900],
 [1203, 3, 11, 239500]]

In [22]:
# Once ingested, list the top 3 rows
for d in data:
    d.insert(0,None)
data[0:3]

[[None, 2104, 3, 70, 399900],
 [None, 1600, 3, 28, 329900],
 [None, 2400, 3, 44, 369000]]

In [23]:
# Now we are going to loop thur every entry in our lists 'INSERT INTO houses VALUES (?,?,?,?,?)'

for d in data:
    c.execute('INSERT INTO houses VALUES (?,?,?,?,?)',d)
conn.commit()

In [24]:
results = c.execute('SELECT * FROM houses;')
results.fetchall()

[(1, 4000, 5, 22, 619000),
 (2, 4000, 5, 22, 619000),
 (3, 2390, 4, 34, 319000),
 (4, 1870, 3, 14, 289000),
 (5, 1505, 3, 90, 269000),
 (6, 2104, 3, 70, 399900),
 (7, 1600, 3, 28, 329900),
 (8, 2400, 3, 44, 369000),
 (9, 1416, 2, 49, 232000),
 (10, 3000, 4, 75, 539900),
 (11, 1985, 4, 61, 299900),
 (12, 1534, 3, 12, 314900),
 (13, 1427, 3, 57, 198999),
 (14, 1380, 3, 14, 212000),
 (15, 1494, 3, 15, 242500),
 (16, 1940, 4, 7, 239999),
 (17, 2000, 3, 27, 347000),
 (18, 1890, 3, 45, 329999),
 (19, 4478, 5, 49, 699900),
 (20, 1268, 3, 58, 259900),
 (21, 2300, 4, 77, 449900),
 (22, 1320, 2, 62, 299900),
 (23, 1236, 3, 78, 199900),
 (24, 2609, 4, 5, 499998),
 (25, 3031, 4, 21, 599000),
 (26, 1767, 3, 44, 252900),
 (27, 1888, 2, 79, 255000),
 (28, 1604, 3, 13, 242900),
 (29, 1962, 4, 53, 259900),
 (30, 3890, 3, 36, 573900),
 (31, 1100, 3, 60, 249900),
 (32, 1458, 3, 29, 464500),
 (33, 2526, 3, 13, 469000),
 (34, 2200, 3, 28, 475000),
 (35, 2637, 3, 25, 299900),
 (36, 1839, 2, 40, 349900),
 (37, 1000, 1, 5, 169900),
 (38, 2040, 4, 75, 314900),
 (39, 3137, 3, 67, 579900),
 (40, 1811, 4, 24, 285900),
 (41, 1437, 3, 50, 249900),
 (42, 1239, 3, 22, 229900),
 (43, 2132, 4, 28, 345000),
 (44, 4215, 4, 66, 549000),
 (45, 2162, 4, 43, 287000),
 (46, 1664, 2, 40, 368500),
 (47, 2238, 3, 37, 329900),
 (48, 2567, 4, 57, 314000),
 (49, 1200, 3, 76, 299000),
 (50, 852, 2, 70, 179900),
 (51, 1852, 4, 64, 299900),
 (52, 1203, 3, 11, 239500)]

In [25]:
import pandas as pd
from pandas.io import sql

In [26]:
data = pd.read_csv('housing-data.csv')
data.head()

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [27]:
conn

In [29]:
# So we ask to take data from sql database, put it into a pandas datastructure called Pandas are cool

data.to_sql('houses_pandas_are_cool',
           con = conn,
           if_exists = 'replace',
            index=False)

In [31]:
results = c.execute('SELECT * FROM houses_pandas_are_cool;')
results.fetchall()[0:5]

[(2104, 3, 70, 399900),
 (1600, 3, 28, 329900),
 (2400, 3, 44, 369000),
 (1416, 2, 49, 232000),
 (3000, 4, 75, 539900)]

In [32]:

this_data_came_from_sql = sql.read_sql('SELECT * FROM houses_pandas_are_cool',
                                      con=conn)

In [33]:
this_data_came_from_sql.head(5)

   sqft  bdrms  age   price
0  2104      3   70  399900
1  1600      3   28  329900
2  2400      3   44  369000
3  1416      2   49  232000
4  3000      4   75  539900

In [34]:
# want to define a function that will do the above

def helper_function(command):
    print sql.read_sql(command, con = conn)

In [35]:
helper_function('SELECT sqft FROM houses')

    sqft
0   4000
1   4000
2   2390
3   1870
4   1505
5   2104
6   1600
7   2400
8   1416
9   3000
10  1985
11  1534
12  1427
13  1380
14  1494
15  1940
16  2000
17  1890
18  4478
19  1268
20  2300
21  1320
22  1236
23  2609
24  3031
25  1767
26  1888
27  1604
28  1962
29  3890
30  1100
31  1458
32  2526
33  2200
34  2637
35  1839
36  1000
37  2040
38  3137
39  1811
40  1437
41  1239
42  2132
43  4215
44  2162
45  1664
46  2238
47  2567
48  1200
49   852
50  1852
51  1203

In [38]:
# We can get all the columns
helper_function('SELECT * FROM houses')

    pk  sqft  bdrms  age   price
0    1  4000      5   22  619000
1    2  4000      5   22  619000
2    3  2390      4   34  319000
3    4  1870      3   14  289000
4    5  1505      3   90  269000
5    6  2104      3   70  399900
6    7  1600      3   28  329900
7    8  2400      3   44  369000
8    9  1416      2   49  232000
9   10  3000      4   75  539900
10  11  1985      4   61  299900
11  12  1534      3   12  314900
12  13  1427      3   57  198999
13  14  1380      3   14  212000
14  15  1494      3   15  242500
15  16  1940      4    7  239999
16  17  2000      3   27  347000
17  18  1890      3   45  329999
18  19  4478      5   49  699900
19  20  1268      3   58  259900
20  21  2300      4   77  449900
21  22  1320      2   62  299900
22  23  1236      3   78  199900
23  24  2609      4    5  499998
24  25  3031      4   21  599000
25  26  1767      3   44  252900
26  27  1888      2   79  255000
27  28  1604      3   13  242900
28  29  1962      4   53  259900
29  30  3890      3   36  573900
30  31  1100      3   60  249900
31  32  1458      3   29  464500
32  33  2526      3   13  469000
33  34  2200      3   28  475000
34  35  2637      3   25  299900
35  36  1839      2   40  349900
36  37  1000      1    5  169900
37  38  2040      4   75  314900
38  39  3137      3   67  579900
39  40  1811      4   24  285900
40  41  1437      3   50  249900
41  42  1239      3   22  229900
42  43  2132      4   28  345000
43  44  4215      4   66  549000
44  45  2162      4   43  287000
45  46  1664      2   40  368500
46  47  2238      3   37  329900
47  48  2567      4   57  314000
48  49  1200      3   76  299000
49  50   852      2   70  179900
50  51  1852      4   64  299900
51  52  1203      3   11  239500

In [40]:
helper_function('SELECT age, sqft, bdrms FROM houses')

    age  sqft  bdrms
0    22  4000      5
1    22  4000      5
2    34  2390      4
3    14  1870      3
4    90  1505      3
5    70  2104      3
6    28  1600      3
7    44  2400      3
8    49  1416      2
9    75  3000      4
10   61  1985      4
11   12  1534      3
12   57  1427      3
13   14  1380      3
14   15  1494      3
15    7  1940      4
16   27  2000      3
17   45  1890      3
18   49  4478      5
19   58  1268      3
20   77  2300      4
21   62  1320      2
22   78  1236      3
23    5  2609      4
24   21  3031      4
25   44  1767      3
26   79  1888      2
27   13  1604      3
28   53  1962      4
29   36  3890      3
30   60  1100      3
31   29  1458      3
32   13  2526      3
33   28  2200      3
34   25  2637      3
35   40  1839      2
36    5  1000      1
37   75  2040      4
38   67  3137      3
39   24  1811      4
40   50  1437      3
41   22  1239      3
42   28  2132      4
43   66  4215      4
44   43  2162      4
45   40  1664      2
46   37  2238      3
47   57  2567      4
48   76  1200      3
49   70   852      2
50   64  1852      4
51   11  1203      3

In [41]:
# to grab some only the top 1o rows...
helper_function('SELECT * FROM houses LIMIT 10;')

   pk  sqft  bdrms  age   price
0   1  4000      5   22  619000
1   2  4000      5   22  619000
2   3  2390      4   34  319000
3   4  1870      3   14  289000
4   5  1505      3   90  269000
5   6  2104      3   70  399900
6   7  1600      3   28  329900
7   8  2400      3   44  369000
8   9  1416      2   49  232000
9  10  3000      4   75  539900

In [44]:
# so we want to do a sort from all the columns, i want to see bdrms 4 and serve up the first 5 rows please
helper_function('SELECT * FROM houses WHERE bdrms = 4 LIMIT 5;')

   pk  sqft  bdrms  age   price
0   3  2390      4   34  319000
1  10  3000      4   75  539900
2  11  1985      4   61  299900
3  16  1940      4    7  239999
4  21  2300      4   77  449900

In [48]:
# multiple search limit 10 but only 5 correct answershelper_function('SELECT * FROM houses WHERE bdrms = 4 LIMIT 5;')
helper_function('SELECT * FROM houses WHERE bdrms = 4 and price <300000 LIMIT 10;')

   pk  sqft  bdrms  age   price
0  11  1985      4   61  299900
1  16  1940      4    7  239999
2  29  1962      4   53  259900
3  40  1811      4   24  285900
4  45  2162      4   43  287000
5  51  1852      4   64  299900

In [49]:
# I want to get the count of all things
helper_function('SELECT COUNT(*) FROM houses;')

   COUNT(*)
0        52

In [50]:
helper_function('SELECT AVG(sqft), MIN(price), MAX(price) FROM houses WHERE bdrms = 2;')

   AVG(sqft)  MIN(price)  MAX(price)
0     1496.5      179900      368500

In [51]:
#Q Whats the avg price per bedroom for a 1 bedrm apt?
helper_function('SELECT AVG(price)FROM houses WHERE bdrms = 1;')

   AVG(price)
0    169900.0

In [60]:
#Q Whats the avg price per bedrrom for a 2 bedroom Apartment?
helper_function('SELECT AVG(price)/2 FROM houses WHERE bdrms = 2;')

# u can add in this code to get a new title using "as"
helper_function('SELECT AVG(price)/2 as price_bdroom1, AVG(price) as price_bdrm2 FROM houses WHERE bdrms = 2;')

    AVG(price)/2
0  140433.333333
   price_bdroom1    price_bdrm2
0  140433.333333  280866.666667

In [61]:
#Q Whats the most frequent apt size in terms of number of bedrooms?
helper_function('SELECT AVG(bdrms)FROM houses;')

   AVG(bdrms)
0        3.25

In [64]:
helper_function('SELECT bdrms, COUNT(*) FROM houses GROUP BY bdrms;')

   bdrms  COUNT(*)
0      1         1
1      2         6
2      3        27
3      4        15
4      5         3

In [66]:
# How old is the oldest 3 bedrm apt?

helper_function('SELECT MAX(age)FROM houses WHERE bdrms = 3;')

helper_function('SELECT * FROM houses WHERE bdrms = 3 and age =90;')

   MAX(age)
0        90
   pk  sqft  bdrms  age   price
0   5  1505      3   90  269000

In [67]:
# How old is the newest Apt?
helper_function('SELECT MIN(age)FROM houses;')

   MIN(age)
0         5

In [68]:
# What is the avg age of the whole dataset
helper_function('SELECT AVG(age)FROM houses;')

    AVG(age)
0  42.134615